Revit 2015 API
BoundarySegmentArrayIterator Class
An iterator to a boundary segment array.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
Syntax
C#
public abstract class BoundarySegmentArrayIterator : APIObject,
	IEnumerator
Visual Basic
Public MustInherit Class BoundarySegmentArrayIterator _
	Inherits APIObject _
	Implements IEnumerator
Visual C++
public ref class BoundarySegmentArrayIterator abstract : public APIObject,
	IEnumerator
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.BoundarySegmentArrayIterator
See Also
BoundarySegmentArrayIterator Members
Autodesk.Revit.DB Namespace